handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_led.c
/**
*     Copyright (c) 2023, Nations Technologies Inc.
* 
*     All rights reserved.
*
*     This software is the exclusive property of Nations Technologies Inc. (Hereinafter 
* referred to as NATIONS). This software, and the product of NATIONS described herein 
* (Hereinafter referred to as the Product) are owned by NATIONS under the laws and treaties
* of the People's Republic of China and other applicable jurisdictions worldwide.
*
*     NATIONS does not grant any license under its patents, copyrights, trademarks, or other 
* intellectual property rights. Names and brands of third party may be mentioned or referred 
* thereto (if any) for identification purposes only.
*
*     NATIONS reserves the right to make changes, corrections, enhancements, modifications, and 
* improvements to this software at any time without notice. Please contact NATIONS and obtain 
* the latest version of this software before placing orders.

*     Although NATIONS has attempted to provide accurate and reliable information, NATIONS assumes 
* no responsibility for the accuracy and reliability of this software.
* 
*     It is the responsibility of the user of this software to properly design, program, and test 
* the functionality and safety of any application made of this information and any resulting product. 
* In no event shall NATIONS be liable for any direct, indirect, incidental, special,exemplary, or 
* consequential damages arising in any way out of the use of this software or the Product.
*
*     NATIONS Products are neither intended nor warranted for usage in systems or equipment, any
* malfunction or failure of which may cause loss of human life, bodily injury or severe property 
* damage. Such applications are deemed, "Insecure Usage".
*
*     All Insecure Usage shall be made at user's risk. User shall indemnify NATIONS and hold NATIONS 
* harmless from and against all claims, costs, damages, and other liabilities, arising from or related 
* to any customer's Insecure Usage.

*     Any express or implied warranty with regard to this software or the Product, including,but not 
* limited to, the warranties of merchantability, fitness for a particular purpose and non-infringement
* are disclaimed to the fullest extent permitted by law.

*     Unless otherwise explicitly permitted by NATIONS, anyone may not duplicate, modify, transcribe
* or otherwise distribute this software for any purposes, in whole or in part.
*
*     NATIONS products and technologies shall not be used for or incorporated into any products or systems
* whose manufacture, use, or sale is prohibited under any applicable domestic or foreign laws or regulations. 
* User shall comply with any applicable export control laws and regulations promulgated and administered by 
* the governments of any countries asserting jurisdiction over the parties or transactions.
**/

/**
*\*\file n32g05x_led.c
*\*\author Nations 
*\*\version v1.0.1
*\*\copyright Copyright (c) 2023, Nations Technologies Inc. All rights reserved.
**/

#include "n32g05x_led.h"
#include "n32g05x.h"

const uint32_t LED_TrimAddrFromNVR[]  = { NVR_ADDR_90H_TRIM,NVR_ADDR_91H_TRIM,NVR_ADDR_92H_TRIM,NVR_ADDR_93H_TRIM,\
                                          NVR_ADDR_94H_TRIM,NVR_ADDR_95H_TRIM,NVR_ADDR_96H_TRIM,NVR_ADDR_97H_TRIM };

const uint16_t COM_Number[] = {0x0000,0x0041,0x00C2,0x01C3,0x03C4,0x07C5,0x0FC6,0x1FC7,0x3FC8,0x7FC9,0xFFCA};

const GPIO_Module* SEG_PORT[] = {SEG0_2PORT, SEG0_2PORT, SEG0_2PORT, SEG3_PORT, SEG4_PORT, SEG5_15_PORT, SEG5_15_PORT, SEG5_15_PORT, \
                                 SEG5_15_PORT, SEG5_15_PORT, SEG5_15_PORT, SEG5_15_PORT, SEG5_15_PORT, SEG5_15_PORT, SEG5_15_PORT, SEG5_15_PORT };

const uint32_t SEG_PIN[] = {SEG0_PIN, SEG1_PIN, SEG2_PIN, SEG3_PIN, SEG4_PIN, SEG5_PIN, SEG6_PIN, SEG7_PIN, \
                            SEG8_PIN, SEG9_PIN, SEG10_PIN, SEG11_PIN, SEG12_PIN, SEG13_PIN, SEG14_PIN, SEG15_PIN };
                        

/**
*\*\name    SPI_SendDataToLED.
*\*\fun     Sends a half-word data through the SPI interface and return the data received from the SPI bus
*\*\param   data  
*\*\         - data to send
*\*\return  The value of the received data
**/
uint16_t SPI_SendDataToLED(uint16_t data)
{
    /* Loop while DAT register in not emplty */
   __IO uint32_t timeout  = 0xFFF;
    
    while((SPI_GetStatus(SPI_LED,SPI_TE_FLAG) == RESET)&& (timeout !=0))
    {
       timeout--;
    } ;
    SPI_TransmitData(SPI_LED,data);
    
    /* Send byte through the SPI1 peripheral */
    timeout = 0xFFF;
    while((SPI_GetStatus(SPI_LED,SPI_RNE_FLAG) == RESET)&& (timeout !=0))
    {
       timeout--;
    } ;

    /* Return the byte read from the SPI bus */
    return SPI_ReceiveData(SPI_LED);
}

/**
*\*\name    LED_TrimGet.
*\*\fun     Get LED trim from NVR.
*\*\return  none
**/
void LED_TrimGet(LED_InitType *led_status_get)
{
    uint32_t tmpreg  = 0;
    uint16_t index   = 0;

    for(index = 0;index<6;index++)
    {
        tmpreg = *(uint32_t*)LED_TrimAddrFromNVR[index];
        led_status_get->Trim_SEG[index] = (uint8_t)tmpreg;
    }
    tmpreg = *(uint32_t*)LED_TrimAddrFromNVR[6];
    led_status_get->Trim_Rset = (uint8_t)tmpreg;
    
    tmpreg = *(uint32_t*)LED_TrimAddrFromNVR[7];
    led_status_get->Trim_BG = (uint8_t)tmpreg;
}

/**
*\*\name    LED_TrimLoad.
*\*\fun     Get LED trim from NVR and set to LED.
*\*\return  none
**/
void LED_TrimLoad(LED_InitType *led_status_set)
{
    uint32_t tmpreg  = 0;
    uint16_t tmpreg1 = 0;
    uint16_t index   = 0;

    for(index = 0;index<6;index++)
    {
        tmpreg1 = 0;
        tmpreg = *(uint32_t*)LED_TrimAddrFromNVR[index];
        tmpreg1 = (uint8_t)tmpreg;
        led_status_set->Trim_SEG[index] = (uint8_t)tmpreg1;
        tmpreg1 |= (0x9000 + (0x100*index) );
        SPI_SendDataToLED(tmpreg1);
    }
    tmpreg1 = 0;
    tmpreg = *(uint32_t*)LED_TrimAddrFromNVR[6];
    tmpreg1 = (uint8_t)(tmpreg&0x1F);
    led_status_set->Trim_Rset = (uint8_t)tmpreg1;
    tmpreg1 |= (LED_CMD_RSET_TRIM_REG_WRITE);
    SPI_SendDataToLED(tmpreg1);
    
    tmpreg1 = 0;
    tmpreg = *(uint32_t*)LED_TrimAddrFromNVR[7];
    tmpreg1 = (uint8_t)(tmpreg&0x1F);
    led_status_set->Trim_BG = (uint8_t)tmpreg1;
    tmpreg1 |= (LED_CMD_BG_TRIM_REG_WRITE);
    SPI_SendDataToLED(tmpreg1);
}

/**
*\*\name    LED_DeInit.
*\*\fun     Reset LED peripheral.
*\*\return  none
*\*\note    Ensure that LED_Init has been called.
**/
void LED_DeInit(void)
{
    /* DISABLE Gclk Output */
    RCC_EnableLEDClk(DISABLE);
    /* config LED_CMD_COM_FORCE_SHUTDOWM register */
    SPI_SendDataToLED(LED_CMD_COM_FORCE_SHUTDOWM);
}

/**
*\*\name    LED_Init.
*\*\fun     Initializes the LED peripheral according to the specified parameters in the
*\*\        LED_InitStruct.
*\*\param   LED_InitStruct.
*\*\          - GCLK_LowLevelNum
*\*\          	- GCLK_LOWLEVELNUM_2 ~ GCLK_LOWLEVELNUM_255
*\*\          - COM_WorkNum
*\*\          	- LED_COM_WORKNUM_2	((uint8_t)	2U)
*\*\          	- LED_COM_WORKNUM_3	((uint8_t)	3U)
*\*\          	- LED_COM_WORKNUM_4	((uint8_t)	4U)
*\*\          	- LED_COM_WORKNUM_5	((uint8_t)	5U)
*\*\          	- LED_COM_WORKNUM_6	((uint8_t)	6U)
*\*\          	- LED_COM_WORKNUM_7	((uint8_t)	7U)
*\*\          	- LED_COM_WORKNUM_8	((uint8_t)	8U)
*\*\          	- LED_COM_WORKNUM_9	((uint8_t)	9U)
*\*\          	- LED_COM_WORKNUM_10	((uint8_t)	10U)
*\*\          - SEG_WorkCurrent
*\*\          	- LED_WORKCURRENT_5_MA
*\*\          	- LED_WORKCURRENT_5_P5_MA
*\*\          	- LED_WORKCURRENT_6_MA
*\*\          	- LED_WORKCURRENT_6_P5_MA
*\*\          	- LED_WORKCURRENT_7_MA
*\*\          	- LED_WORKCURRENT_7_P5_MA
*\*\          	- LED_WORKCURRENT_8_MA
*\*\          	- LED_WORKCURRENT_8_P5_MA
*\*\          	- LED_WORKCURRENT_9_MA
*\*\          	- LED_WORKCURRENT_9_P5_MA
*\*\          	- LED_WORKCURRENT_10_MA
*\*\          	- LED_WORKCURRENT_10_P5_MA
*\*\          	- LED_WORKCURRENT_11_MA
*\*\          	- LED_WORKCURRENT_11_P5_MA
*\*\          	- LED_WORKCURRENT_12_MA
*\*\          	- LED_WORKCURRENT_12_P5_MA
*\*\          	- LED_WORKCURRENT_13_MA
*\*\          	- LED_WORKCURRENT_13_P5_MA
*\*\          	- LED_WORKCURRENT_14_MA
*\*\          	- LED_WORKCURRENT_14_P5_MA
*\*\          	- LED_WORKCURRENT_15_MA
*\*\          	- LED_WORKCURRENT_15_P5_MA
*\*\          	- LED_WORKCURRENT_16_MA
*\*\          	- LED_WORKCURRENT_16_P5_MA
*\*\          	- LED_WORKCURRENT_17_MA
*\*\          	- LED_WORKCURRENT_17_P5_MA
*\*\          	- LED_WORKCURRENT_18_MA
*\*\          	- LED_WORKCURRENT_18_P5_MA
*\*\          	- LED_WORKCURRENT_19_MA
*\*\          	- LED_WORKCURRENT_19_P5_MA
*\*\          	- LED_WORKCURRENT_20_MA
*\*\          - ScanMode
*\*\          	- LED_SCAN_MODE_8SEG_8SEG
*\*\          	- LED_SCAN_MODE_16SEG
*\*\          - SEG_WorkStatus
*\*\          	- LED_WORK_MODE_DISABLE
*\*\          	- LED_WORK_MODE_ENABLE
*\*\return  none
**/
void LED_Init(LED_InitType* LED_InitStruct)
{
    uint16_t tmpreg1 = 0;
    
