handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_led.c
    /* config LED_CMD_COM_FORCE_SHUTDOWM register */
    SPI_SendDataToLED(LED_CMD_COM_FORCE_SHUTDOWM);

    SPI_SendDataToLED(LED_CMD_COM_SCAN_RESET);
    SPI_SendDataToLED(0xA000U);
	
    /* config LED_CMD_CHIP_WAKEUP register */
    SPI_SendDataToLED(LED_CMD_CHIP_WAKEUP);
    /* config LED_CMD_COM_NUM_COM0_1_WORK_STATUS register */
    tmpreg1 |= LED_CMD_COM_NUM_COM0_1_WORK_STATUS;
    tmpreg1 |= (COM_Number[LED_InitStruct->COM_WorkNum]&0x00FFU);
    SPI_SendDataToLED(tmpreg1);
    tmpreg1 = 0;
    /* config LED_CMD_COM2_9_WORK_STATUS register */
    tmpreg1 |= LED_CMD_COM2_9_WORK_STATUS;
    tmpreg1 |= COM_Number[LED_InitStruct->COM_WorkNum]>>8;
    SPI_SendDataToLED(tmpreg1);
	
    tmpreg1 = 0;
    /* config LED_CMD_SEG0_7_WORK_STATUS register */
    /* set seg0 ~ seg7 work status  */
    tmpreg1 |= LED_CMD_SEG0_7_WORK_STATUS;
    tmpreg1 |= (LED_InitStruct->SEG_WorkStatus&0x00ffU);
    SPI_SendDataToLED(tmpreg1);
    tmpreg1 = 0;
    /* set seg8 ~ seg15 work status  */
    tmpreg1 |= LED_CMD_SEG8_15_WORK_STATUS;
    tmpreg1 |= (LED_InitStruct->SEG_WorkStatus>>8);
    SPI_SendDataToLED(tmpreg1);
	
	
    tmpreg1 = 0;
    /* config LED_CMD_SEG_CUR_DISP_MODE_CHIP_EN register */
    tmpreg1 |= LED_CMD_SEG_CUR_DISP_MODE_CHIP_EN;
    /* set work current */
    tmpreg1 |= (uint16_t)LED_InitStruct->SEG_WorkCurrent | 0x0020U;
    /* set scan mode */
    tmpreg1 |= ((uint16_t)LED_InitStruct->Scan_Mode<<6);
		/* set work mode */
    tmpreg1 |= ((uint16_t)LED_InitStruct->Work_Mode)<<7;
    SPI_SendDataToLED(tmpreg1);
	
    tmpreg1 = 0;
    /* Load the trim value from NVR address for LED*/
    LED_TrimLoad(LED_InitStruct);
}

/**
*\*\name    LED_SEG_DutyDataSet.
*\*\fun     Set the LED seg duty data.
*\*\param   SegId .
*\*\          - this value must be range of 0~15
*\*\param   duty .
*\*\          - this value must be range of 0~63
*\*\return  none
**/
void LED_SEG_DutyDataSet(uint8_t SegId, uint8_t duty)
{
    uint16_t tmpreg1;

    if(SegId < MAX_LED_SEG_ID)
    {
        tmpreg1  = (LED_CMD_SEG0_DUTY_DATA+ (SegId *0x100)) ;
        if(duty < MAX_LED_SEG_DUTY)
        {
            tmpreg1 |= ((uint16_t)duty & MAX_LED_SEG_DUTY);
        }
        else
        {
            tmpreg1 |= MAX_LED_SEG_DUTY;
        }
        SPI_SendDataToLED(tmpreg1);
    }
    else
    {
        /* no process */
    }
}
/**
*\*\name    LED_Get_Cur_ScanCOM_List.
*\*\fun     Get the current scanning COM list for LED.
*\*\param   COM_num:total numbers of LED operation;
*\*\param   index:
*\*\param   com_scan_list:  history list of COM port scans. 
*\*\return  none.
**/
void LED_Get_Cur_ScanCOM_List(uint8_t COM_num, uint8_t index, uint8_t *com_scan_list)
{
    uint16_t tmpreg1,tmpreg2;

    if(index >= COM_num)
    {
        return;
    }
    
    SPI_LED->DAT;
    SPI_LED->DAT;
    
    tmpreg1 = LED_CMD_READ_REG;
    tmpreg1 |= 0x27U;
    tmpreg1 = SPI_SendDataToLED(tmpreg1);

    tmpreg2= SPI_SendDataToLED(SPI_DUMMY_DATA);
    
    com_scan_list[index &0x0F] = (uint8_t)(tmpreg2&0xFFU);

    /* Close the read back command */
    SPI_SendDataToLED(LED_CMD_READ_OFF);
}

/**
*\*\name    LED_Check_Cur_ScanCOM.
*\*\fun     Check the current scanning COM list for LED.
*\*\param   COM_num:total numbers of LED operation;
*\*\param   index:
*\*\return  none.
**/
ErrorStatus LED_Check_Cur_ScanCOM(uint8_t COM_num, uint8_t index)
{
    uint16_t tmpreg1,tmpreg2;

    if(index >= COM_num)
    {
        return ERROR;
    }
    
    SPI_LED->DAT;
    SPI_LED->DAT;
    
    tmpreg1 = LED_CMD_READ_REG;
    tmpreg1 |= 0x27U;
    tmpreg1 = SPI_SendDataToLED(tmpreg1);

    tmpreg2= SPI_SendDataToLED(SPI_DUMMY_DATA);

    /* Close the read back command */
    SPI_SendDataToLED(LED_CMD_READ_OFF);
    
    if((uint8_t)(tmpreg2&0xFFU) != index)
    {
        return ERROR;
    }
    else
    {
       /* no process */
    }
    
    return SUCCESS;
}
/**
*\*\name    Get_LED_Scan_COM_Status.
*\*\fun     Get the current scanning COM status.
*\*\param   COM_num:total numbers of LED operation;
*\*\param   com_scan_list:  history list of COM port scans. 
*\*\return  ErrorStatus. 
*\*\          - ERROR:  LED operation status is abnormal;
*\*\          - SUCCESS:  LED operation status is normal;
**/
ErrorStatus Get_LED_Scan_COM_Status(uint8_t COM_num, uint8_t *com_scan_list)
{
    uint8_t index;
    ErrorStatus status = SUCCESS ;
    
    for(index = 0; index < COM_num; index++)
    {
        if (index != com_scan_list[index])
        {
            status = ERROR;
        }
    }
    return status;
}

/**
*\*\name    LED_Get_RegData.
*\*\fun     Get the status of LED,including triming data, work current, ect.
*\*\param   none.
*\*\return  none.
**/
void LED_Get_RegData(LED_InitType *led_status_get)
{
    uint16_t tmpreg1, tmpreg2;
    uint16_t i;

    /* Read back the RSET command */
    tmpreg1 = LED_CMD_READ_REG;
    tmpreg1 |= 0x16U;
    SPI_SendDataToLED(tmpreg1) ;
    tmpreg2= SPI_SendDataToLED(SPI_DUMMY_DATA);
    led_status_get->Trim_Rset = (uint8_t)(tmpreg2&0x1FU) ;
    tmpreg1 = 0;
    
    /* Read back the BG command */
    tmpreg1 |= LED_CMD_READ_REG;
    tmpreg1 |= 0x17U;
    SPI_SendDataToLED(tmpreg1);
    tmpreg2= SPI_SendDataToLED(SPI_DUMMY_DATA);
    led_status_get->Trim_BG = (uint8_t)(tmpreg2&0x1FU);
    tmpreg1 = 0;  
    
    /* Read back the Trim duty commands */
    for(i = 0;i<6;i++)
    {
        tmpreg1 |= LED_CMD_READ_REG;
        tmpreg1 |= 0x10 + i;
        SPI_SendDataToLED(tmpreg1);
        tmpreg2= SPI_SendDataToLED(SPI_DUMMY_DATA);
        led_status_get->Trim_SEG[i] = (uint8_t)(tmpreg2 &0xFFU);
        tmpreg1 = 0;
    }
    
    /* Read back the work current / display mode/ chip enable commands */
    tmpreg1 |= LED_CMD_READ_REG;
    tmpreg1 |= 0x20U;
    SPI_SendDataToLED(tmpreg1) ;
    tmpreg2= SPI_SendDataToLED(SPI_DUMMY_DATA);
    led_status_get->SEG_WorkCurrent = (tmpreg2 &0x1FU);
    led_status_get->Scan_Mode =  ((tmpreg2 & 0x0040U) != 0)? 0x01U : 0x00U ;
    led_status_get->Work_Mode = ((tmpreg2 & 0x80U) != 0)? 0x01U : 0x00U ;
    tmpreg1 = 0; 
    
    /* Read back the the number of COM commands */
    tmpreg1 |= LED_CMD_READ_REG;
    tmpreg1 |= 0x21U;
    SPI_SendDataToLED(tmpreg1);
    SPI_LED->DAT;
    tmpreg2= SPI_SendDataToLED(SPI_DUMMY_DATA);;
    led_status_get->COM_WorkNum = (uint8_t)(tmpreg2 &0x0FU) ;
    tmpreg1 = 0;
    
    /* Read back the the working status of SEG0 -SEG7 commands */
    tmpreg1 |= LED_CMD_READ_REG;
    tmpreg1 |= 0x23U;
    SPI_SendDataToLED(tmpreg1);
    tmpreg2= SPI_SendDataToLED(SPI_DUMMY_DATA);;
    led_status_get->SEG_WorkStatus = (uint8_t)(tmpreg2&0xFFU) ;
    tmpreg1 = 0;
    
    /* Read back the the working status of SEG8 -SEG15 commands */
    tmpreg1 |= LED_CMD_READ_REG;
    tmpreg1 |= 0x24U;
    SPI_SendDataToLED(tmpreg1);
    tmpreg2= SPI_SendDataToLED(SPI_DUMMY_DATA);
    led_status_get->SEG_WorkStatus |= ((tmpreg2&0xFFU)<<8) ;
    tmpreg1 = 0;
    
