handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_led.c
    /* Read back the the duty status of SEG0 -SEG15 */
    for(i = 0;i<16;i++)
    {
        tmpreg1 |= LED_CMD_READ_REG;
        tmpreg1 |= 0x30U + i;
        SPI_SendDataToLED(tmpreg1);
        tmpreg2= SPI_SendDataToLED(SPI_DUMMY_DATA);
        led_status_get->SEG_Duty[i] = (uint8_t)(tmpreg2&0xFFU);
        tmpreg1 = 0;
    }

    /* Close the read back command */
    SPI_SendDataToLED(LED_CMD_READ_OFF);
}
/**
*\*\name    LED_InitStruct.
*\*\fun     Fills each LED_InitType member with its default value.
*\*\param   LED_InitType (The input parameters must be the following values):
*\*\          - GCLK_LowLevelNum
*\*\          - COM_WorkNum
*\*\          - SEG_WorkCurrent
*\*\          - SEG_WorkStatus
*\*\          - Scan_Mode
*\*\          - Work_Mode
*\*\return  none
**/
void LED_InitStruct(LED_InitType* LED_InitStruct)
{
    uint8_t index = 0U;
	
    /* initialize the GCLK_LowLevelNum member */
    LED_InitStruct->GCLK_LowLevelNum        = GCLK_LOWLEVELNUM_20;
    /* Initialize the COM_WorkNum member */
    LED_InitStruct->COM_WorkNum             = LED_COM_WORKNUM_10;
    /* initialize the SEG_WorkCurrent member */
    LED_InitStruct->SEG_WorkCurrent         = LED_WORKCURRENT_7_P5_MA;
    /* Initialize the SEG_WorkStatus */
    LED_InitStruct->SEG_WorkStatus          = 0U;
    /* Initialize the ScanMode */
    LED_InitStruct->Scan_Mode               = LED_SCAN_MODE_8SEG_8SEG;
    /* Initialize the LED status */
    LED_InitStruct->Work_Mode               = DISABLE;

    /* Initialize the LED Cur_ScanCOM */
    LED_InitStruct->Cur_ScanCOM             = LED_CUR_SCANCOM_SHUTDOWM;
    /* Initialize the LED SEG_Duty */
    for(index = 0; index < MAX_LED_SEG_ID; index++)
    {
        LED_InitStruct->SEG_Duty[index]     = 0U;
    }
    
    /* Initialize the LED Trim_Rset */
    LED_InitStruct->Trim_Rset               = 0U;
    /* Initialize the LED Trim_BG */
    LED_InitStruct->Trim_BG                 = 0U;
    /* Initialize the LED Trim_SEG */
    for(index = 0; index < 6U; index++)
    {
        LED_InitStruct->Trim_SEG[index]     = 0U;
    }
}

/**
*\*\name    LED_GclkConfiguration.
*\*\fun     Configures GCLK clocks frequency and init configuration.
*\*\param   LED_clksrc(LED clock source):
*\*\         - LED_GCLK_SRC_HSI    HSI clock selected 
*\*\         - LED_GCLK_SRC_HSE    HSE clock selected 
*\*\param   LED_prescaler(LED clock prescaler):
*\*\         - LED_GCLK_DIV1 
*\*\         - LED_GCLK_DIV32
*\*\         - LED_GCLK_DIV40
*\*\         - LED_GCLK_DIV50
*\*\         - LED_GCLK_DIV64
*\*\         - LED_GCLK_DIV80
*\*\         - LED_GCLK_DIV160
*\*\return  none
*\*\note  LED GCLK must be in the range of 50kHz ~ 250kHz.
**/
void LED_GclkConfiguration(uint32_t LED_clksrc, uint32_t LED_prescaler)
{
    /* Configures the LED clock frequency */
    RCC_ConfigLEDClk(LED_clksrc,LED_prescaler);
    /* this value must be fix at 130 */
    RCC_SetLEDClockCycles(LED_CLOCK_CYCLE_NUMBER);
}

/**
*\*\name    LED_SPI_Init.
*\*\fun     Configures the different system clocks.
*\*\return  none
*\*\note  LED SPI Baud-rate cannot greater than 3M.
**/
void LED_SpiInit(void)
{
    SPI_InitType SPI_InitStructure;

    SPI_DeInit(SPI_LED);

    SPI_InitStruct(&SPI_InitStructure);
    SPI_InitStructure.DataDirection = SPI_DIR_DOUBLELINE_FULLDUPLEX;   
    SPI_InitStructure.SpiMode       = SPI_MODE_MASTER;
    SPI_InitStructure.DataLen       = SPI_DATA_SIZE_16BITS;
    SPI_InitStructure.CLKPOL        = SPI_CLKPOL_LOW;
    SPI_InitStructure.CLKPHA        = SPI_CLKPHA_FIRST_EDGE;
    SPI_InitStructure.NSS           = SPI_NSS_HARD; 
    SPI_InitStructure.BaudRatePres  = SPI_BR_PRESCALER_32;
    SPI_InitStructure.FirstBit      = SPI_FB_MSB;
    SPI_InitStructure.CRCPoly       = 7;
    SPI_Init(SPI_LED, &SPI_InitStructure);
    
    SPI_SSOutputEnable(SPI_LED, ENABLE);

    SPI_Enable(SPI_LED, ENABLE);
}

/**
*\*\name    RCC_Configuration.
*\*\fun     Configures the different system clocks.
*\*\return  none
**/
void LED_RccConfiguration(void)
{
    /* Enable LED_SPIx / LED_SPIx_GPIO / GCLK GPIO / LED_COM_SEG GPIO clocks */
    RCC_EnableAPB2PeriphClk(SPIx_CLK | SPIx_LED_CLK | RCC_APB2_PERIPH_AFIO | \
	                          RCC_APB2_PERIPH_GPIOA | RCC_APB2_PERIPH_GPIOB | \
	                          RCC_APB2_PERIPH_GPIOC | RCC_APB2_PERIPH_GPIOD, ENABLE);
}

/**
*\*\name    LED_GpioConfiguration.
*\*\fun     Configures the different SPIx GPIO, GCLK ports, LED COM and SEG ports according to the specified params COM_WorkNum and SEG_WorkStatus.
*\*\param   COM_WorkNum. the total number of working COM.  
*\*\          -  this value must be range of 1 ~ 10.
*\*\param   SEG_WorkStatus. selected the working SEG.
*\*\          -  this value must be range of 0 ~ 0xFFFF.Bit0 - SEG0,Bit1 - SEG1...Bit15 - SEG15
*\*\             eg :when SEG_WorkStatus = 0x1841 it means SEG0,SEG6,SEG11,SEG15 will eable to work
*\*\return  none
**/
void LED_GpioConfiguration(uint8_t COM_WorkNum, uint16_t SEG_WorkStatus)
{
    GPIO_InitType GPIO_InitStructure;
    uint8_t  index ;

    GPIO_InitStruct(&GPIO_InitStructure);
    /* Configure Gclk pins: GCLK --------------------------------*/
    GPIO_InitStructure.Pin        = SPIx_LED_GCLK_PIN ;
    GPIO_InitStructure.GPIO_Alternate = GPIO_AF5_LED;
    GPIO_InitStructure.GPIO_Mode = GPIO_MODE_AF_PP;
    GPIO_InitPeripheral(SPIx_LED_GCLK_PORT, &GPIO_InitStructure);

    /* Configure SPIx pins: NSS ---------------------------------*/
    GPIO_InitStructure.Pin        = SPIx_LED_NSS_PIN ;
    GPIO_InitStructure.GPIO_Alternate = SPIx_LED_NSS_AFIO;
    GPIO_InitStructure.GPIO_Mode = GPIO_MODE_AF_PP;
    GPIO_InitPeripheral(SPIx_LED_NSS_PORT, &GPIO_InitStructure);

    /* Configure SPIx pins: SCK ---------------------------------*/
    GPIO_InitStructure.Pin        = SPIx_LED_SCK_PIN ;
    GPIO_InitStructure.GPIO_Alternate = SPIx_LED_SCK_AFIO;
    GPIO_InitStructure.GPIO_Mode = GPIO_MODE_AF_PP;
    GPIO_InitPeripheral(SPIx_LED_SCK_PORT, &GPIO_InitStructure);

    /* Configure SPIx pins: MOSI --------------------------------*/
    GPIO_InitStructure.Pin        = SPIx_LED_MOSI_PIN ;
    GPIO_InitStructure.GPIO_Alternate = SPIx_LED_MOSI_AFIO;
    GPIO_InitStructure.GPIO_Mode = GPIO_MODE_AF_PP;
    GPIO_InitPeripheral(SPIx_LED_MOSI_PORT, &GPIO_InitStructure);

    /* Configure SPIx pins: MISO -------------------------------*/
    GPIO_InitStructure.Pin        = SPIx_LED_MISO_PIN ;
    GPIO_InitStructure.GPIO_Alternate = SPIx_LED_MISO_AFIO;
    GPIO_InitStructure.GPIO_Mode = GPIO_MODE_AF_PP;
    GPIO_InitStructure.GPIO_Pull = GPIO_NO_PULL;
    GPIO_InitPeripheral(SPIx_LED_MISO_PORT, &GPIO_InitStructure);

    /* Configure COM pins---------------------------------------*/
    GPIO_InitStruct(&GPIO_InitStructure);
    if(COM_WorkNum >= 1)
    {
        GPIO_InitStructure.Pin        = COM0_PIN ;
        GPIO_InitStructure.GPIO_Mode = GPIO_MODE_ANALOG;
        GPIO_InitPeripheral(COM0_2_PORT, &GPIO_InitStructure);
    }
    if(COM_WorkNum >= 2)
    {
        GPIO_InitStructure.Pin        = COM1_PIN ;
        GPIO_InitPeripheral(COM0_2_PORT, &GPIO_InitStructure);
    }
    if(COM_WorkNum >= 3)
    {
        GPIO_InitStructure.Pin        = COM2_PIN ;
        GPIO_InitPeripheral(COM0_2_PORT, &GPIO_InitStructure);
    }
    if(COM_WorkNum >= 4)
    {
        GPIO_InitStructure.Pin        = COM3_PIN ;
        GPIO_InitPeripheral(COM3_PORT, &GPIO_InitStructure);
    }
    if(COM_WorkNum >= 5)
    {
        GPIO_InitStructure.Pin        = COM4_PIN ;
        GPIO_InitPeripheral(COM4_PORT, &GPIO_InitStructure);
    }
    if(COM_WorkNum >= 6)
    {
        GPIO_InitStructure.Pin        = COM5_PIN ;
        GPIO_InitPeripheral(COM5_9_PORT, &GPIO_InitStructure);
    }
    if(COM_WorkNum >= 7)
    {
        GPIO_InitStructure.Pin        = COM6_PIN ;
        GPIO_InitPeripheral(COM5_9_PORT, &GPIO_InitStructure);
    }
    if(COM_WorkNum >= 8)
    {
        GPIO_InitStructure.Pin        = COM7_PIN ;
        GPIO_InitPeripheral(COM5_9_PORT, &GPIO_InitStructure);
    }
    if(COM_WorkNum >= 9)
    {
        GPIO_InitStructure.Pin        = COM8_PIN ;
        GPIO_InitPeripheral(COM5_9_PORT, &GPIO_InitStructure);
    }
    if(COM_WorkNum >= 10)
    {
        GPIO_InitStructure.Pin        = COM9_PIN ;
        GPIO_InitPeripheral(COM5_9_PORT, &GPIO_InitStructure);
    }
    /* Configure SEG pins---------------------------------------*/
    for(index = 0;index < 16;index ++)
    {
        if((SEG_WorkStatus & ((uint16_t)1<<index)) !=0 )
        {
            GPIO_InitStructure.Pin = SEG_PIN[index];
            GPIO_InitPeripheral((GPIO_Module*)SEG_PORT[index], &GPIO_InitStructure);
        }
    }
}
